MAXLII/ATOMAN/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Source/ARM/startup_hc32f558.s
;/**
; ******************************************************************************
;  @file  startup_hc32f558.s
;  @brief Startup for MDK.
; verbatim
;  Change Logs:
;  Date             Author          Notes
;  2026-04-16       CDT             First version
; endverbatim
; *****************************************************************************
; * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
; *
; * This software component is licensed by XHSC under BSD 3-Clause license
; * (the "License"); You may not use this file except in compliance with the
; * License. You may obtain a copy of the License at:
; *                    opensource.org/licenses/BSD-3-Clause
; *
; ******************************************************************************
; */

; Stack Configuration
; Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>

Stack_Size      EQU     0x00002000

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; Heap Configuration
;  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>

Heap_Size       EQU     0x00002000

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

                PRESERVE8
                THUMB

; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; Peripheral Interrupts
                DCD     IRQ000_Handler
                DCD     IRQ001_Handler
                DCD     IRQ002_Handler
                DCD     IRQ003_Handler
                DCD     IRQ004_Handler
                DCD     IRQ005_Handler
                DCD     IRQ006_Handler
                DCD     IRQ007_Handler
                DCD     IRQ008_Handler
                DCD     IRQ009_Handler
                DCD     IRQ010_Handler
                DCD     IRQ011_Handler
                DCD     IRQ012_Handler
                DCD     IRQ013_Handler
                DCD     IRQ014_Handler
                DCD     IRQ015_Handler
                DCD     EXTINT_PORT_EIRQ0_Handler
                DCD     EXTINT_PORT_EIRQ1_Handler
                DCD     EXTINT_PORT_EIRQ2_Handler
                DCD     EXTINT_PORT_EIRQ3_Handler
                DCD     EXTINT_PORT_EIRQ4_Handler
                DCD     EXTINT_PORT_EIRQ5_Handler
                DCD     EXTINT_PORT_EIRQ6_Handler
                DCD     EXTINT_PORT_EIRQ7_Handler
                DCD     EXTINT_PORT_EIRQ8_Handler
                DCD     EXTINT_PORT_EIRQ9_Handler
                DCD     EXTINT_PORT_EIRQ10_Handler
                DCD     EXTINT_PORT_EIRQ11_Handler
                DCD     EXTINT_PORT_EIRQ12_Handler
                DCD     EXTINT_PORT_EIRQ13_Handler
                DCD     EXTINT_PORT_EIRQ14_Handler
                DCD     EXTINT_PORT_EIRQ15_Handler
                DCD     DMA1_Error_Handler
                DCD     DMA1_TC0_BTC0_Handler
                DCD     DMA1_TC1_BTC1_Handler
                DCD     DMA1_TC2_BTC2_Handler
                DCD     DMA1_TC3_BTC3_Handler
                DCD     DMA1_TC4_BTC4_Handler
                DCD     DMA1_TC5_BTC5_Handler
                DCD     DMA1_TC6_BTC6_Handler
                DCD     DMA1_TC7_BTC7_Handler
                DCD     EFM_PEError_ReadCol_Handler
                DCD     EFM_OpEnd_Handler
                DCD     FPU_Error_Handler
                DCD     DMA2_Error_Handler
                DCD     DMA2_TC0_BTC0_Handler
                DCD     DMA2_TC1_BTC1_Handler
                DCD     DMA2_TC2_BTC2_Handler
                DCD     DMA2_TC3_BTC3_Handler
                DCD     DMA2_TC4_BTC4_Handler
                DCD     DMA2_TC5_BTC5_Handler
                DCD     DMA2_TC6_BTC6_Handler
                DCD     DMA2_TC7_BTC7_Handler
                DCD     PID_CALC_OV_Handler
                DCD     PID_CMP_Handler
                DCD     FMAC_FIR_Handler
                DCD     FMAC_IIR_Handler
                DCD     FMAC_RAM_ECC_ERR_Handler
                DCD     CORDIC_Handler
                DCD     TMR0_1_Handler
                DCD     TMR0_2_Handler
                DCD     XTAL_Handler
                DCD     SWDT_Handler
                DCD     TMR6_1_GCmp_Handler
                DCD     TMR6_1_Ovf_Udf_Handler
                DCD     TMR6_1_Dte_Handler
                DCD     TMR6_1_SCmp_Handler
                DCD     TMR6_2_GCmp_Handler
                DCD     TMR6_2_Ovf_Udf_Handler
                DCD     TMR6_2_Dte_Handler
                DCD     TMR6_2_SCmp_Handler
                DCD     TMR6_3_GCmp_Handler
                DCD     TMR6_3_Ovf_Udf_Handler
                DCD     TMR6_3_Dte_Handler
                DCD     TMR6_3_SCmp_Handler
                DCD     TMR6_4_GCmp_Handler
                DCD     TMR6_4_Ovf_Udf_Handler
                DCD     TMR6_4_Dte_Handler
                DCD     TMR6_4_SCmp_Handler
                DCD     TMR6_5_GCmp_Handler
                DCD     TMR6_5_Ovf_Udf_Handler
                DCD     TMR6_5_Dte_Handler
                DCD     TMR6_5_SCmp_Handler
                DCD     TMR6_6_GCmp_Handler
                DCD     TMR6_6_Ovf_Udf_Handler
                DCD     TMR6_6_Dte_Handler
                DCD     TMR6_6_SCmp_Handler
                DCD     TRLPWM_Handler
                DCD     EMB_GR0_Handler
                DCD     EMB_GR1_Handler
                DCD     EMB_GR2_Handler
                DCD     EMB_GR3_Handler
                DCD     EMB_GR4_Handler
                DCD     EMB_GR5_Handler
                DCD     HRPWM_1_Handler
                DCD     HRPWM_2_Handler
                DCD     HRPWM_3_Handler
                DCD     HRPWM_4_Handler
                DCD     HRPWM_5_Handler
                DCD     HRPWM_6_Handler
                DCD     HRPWM_7_Handler
                DCD     HRPWM_8_Handler
                DCD     HRPWM_EMB_Handler
                DCD     SDFM_FILTER0_Handler
                DCD     SDFM_FILTER1_Handler
                DCD     SDFM_FILTER2_Handler
                DCD     SDFM_FILTER3_Handler
                DCD     CMP1_Handler
                DCD     CMP2_Handler
                DCD     CMP3_Handler
                DCD     CMP4_Handler
                DCD     CMP5_Handler
                DCD     CMP6_Handler
                DCD     CMP7_Handler
                DCD     CMP8_Handler
                DCD     SPI1_Handler
                DCD     SPI2_Handler
                DCD     SPI3_Handler
                DCD     EVENT_PORT1_Handler
                DCD     EVENT_PORT2_Handler
                DCD     EVENT_PORT3_Handler
                DCD     EVENT_PORT4_Handler
                DCD     MCANRAM_ECCER_Handler
                DCD     MCAN1_INT0_Handler
                DCD     MCAN1_INT1_Handler
                DCD     MCAN2_INT0_Handler
                DCD     MCAN2_INT1_Handler
                DCD     MCAN3_INT0_Handler
                DCD     MCAN3_INT1_Handler
                DCD     USART1_Handler
                DCD     USART1_TxComplete_Handler
                DCD     USART2_Handler
                DCD     USART2_TxComplete_Handler
                DCD     USART3_Handler
                DCD     USART3_TxComplete_Handler
                DCD     USART4_Handler
                DCD     USART4_TxComplete_Handler
                DCD     HASH_Handler
                DCD     SKE_Handler
                DCD     SOGI_Handler
                DCD     I2C1_Handler
                DCD     I2C2_Handler
                DCD     I2C3_Handler
                DCD     SPI_SS0_WUPI_Handler
                DCD     USART1_WUPI_Handler
                DCD     LVD1_Handler
                DCD     LVD2_Handler
                DCD     FCM_Handler
                DCD     WDT_Handler
                DCD     CTC_Handler
                DCD     ERMU_LPI_Handler
                DCD     ADC1_Handler
                DCD     ADC2_Handler
                DCD     ADC3_Handler
                DCD     ADC4_Handler
                DCD     TRNG_Handler

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY

