MAXLII/ATOMAN/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Source/ARM/startup_hc32f558.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
;ClrSramSR
                LDR     R0, =0x40050810
                LDR     R1, =0x7FEF0
                STR     R1, [R0]

                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC
                EXPORT  IRQ000_Handler                  [WEAK]
                EXPORT  IRQ001_Handler                  [WEAK]
                EXPORT  IRQ002_Handler                  [WEAK]
                EXPORT  IRQ003_Handler                  [WEAK]
                EXPORT  IRQ004_Handler                  [WEAK]
                EXPORT  IRQ005_Handler                  [WEAK]
                EXPORT  IRQ006_Handler                  [WEAK]
                EXPORT  IRQ007_Handler                  [WEAK]
                EXPORT  IRQ008_Handler                  [WEAK]
                EXPORT  IRQ009_Handler                  [WEAK]
                EXPORT  IRQ010_Handler                  [WEAK]
                EXPORT  IRQ011_Handler                  [WEAK]
                EXPORT  IRQ012_Handler                  [WEAK]
                EXPORT  IRQ013_Handler                  [WEAK]
                EXPORT  IRQ014_Handler                  [WEAK]
                EXPORT  IRQ015_Handler                  [WEAK]
                EXPORT  EXTINT_PORT_EIRQ0_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ1_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ2_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ3_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ4_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ5_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ6_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ7_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ8_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ9_Handler       [WEAK]
                EXPORT  EXTINT_PORT_EIRQ10_Handler      [WEAK]
                EXPORT  EXTINT_PORT_EIRQ11_Handler      [WEAK]
                EXPORT  EXTINT_PORT_EIRQ12_Handler      [WEAK]
                EXPORT  EXTINT_PORT_EIRQ13_Handler      [WEAK]
                EXPORT  EXTINT_PORT_EIRQ14_Handler      [WEAK]
                EXPORT  EXTINT_PORT_EIRQ15_Handler      [WEAK]
                EXPORT  DMA1_Error_Handler              [WEAK]
                EXPORT  DMA1_TC0_BTC0_Handler           [WEAK]
                EXPORT  DMA1_TC1_BTC1_Handler           [WEAK]
                EXPORT  DMA1_TC2_BTC2_Handler           [WEAK]
                EXPORT  DMA1_TC3_BTC3_Handler           [WEAK]
                EXPORT  DMA1_TC4_BTC4_Handler           [WEAK]
                EXPORT  DMA1_TC5_BTC5_Handler           [WEAK]
                EXPORT  DMA1_TC6_BTC6_Handler           [WEAK]
                EXPORT  DMA1_TC7_BTC7_Handler           [WEAK]
                EXPORT  EFM_PEError_ReadCol_Handler     [WEAK]
                EXPORT  EFM_OpEnd_Handler               [WEAK]
                EXPORT  FPU_Error_Handler               [WEAK]
                EXPORT  DMA2_Error_Handler              [WEAK]
                EXPORT  DMA2_TC0_BTC0_Handler           [WEAK]
                EXPORT  DMA2_TC1_BTC1_Handler           [WEAK]
                EXPORT  DMA2_TC2_BTC2_Handler           [WEAK]
                EXPORT  DMA2_TC3_BTC3_Handler           [WEAK]
                EXPORT  DMA2_TC4_BTC4_Handler           [WEAK]
                EXPORT  DMA2_TC5_BTC5_Handler           [WEAK]
                EXPORT  DMA2_TC6_BTC6_Handler           [WEAK]
                EXPORT  DMA2_TC7_BTC7_Handler           [WEAK]
                EXPORT  PID_CALC_OV_Handler             [WEAK]
                EXPORT  PID_CMP_Handler                 [WEAK]
                EXPORT  FMAC_FIR_Handler                [WEAK]
                EXPORT  FMAC_IIR_Handler                [WEAK]
                EXPORT  FMAC_RAM_ECC_ERR_Handler        [WEAK]
                EXPORT  CORDIC_Handler                  [WEAK]
                EXPORT  TMR0_1_Handler                  [WEAK]
                EXPORT  TMR0_2_Handler                  [WEAK]
                EXPORT  XTAL_Handler                    [WEAK]
                EXPORT  SWDT_Handler                    [WEAK]
                EXPORT  TMR6_1_GCmp_Handler             [WEAK]
                EXPORT  TMR6_1_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_1_Dte_Handler              [WEAK]
                EXPORT  TMR6_1_SCmp_Handler             [WEAK]
                EXPORT  TMR6_2_GCmp_Handler             [WEAK]
                EXPORT  TMR6_2_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_2_Dte_Handler              [WEAK]
                EXPORT  TMR6_2_SCmp_Handler             [WEAK]
                EXPORT  TMR6_3_GCmp_Handler             [WEAK]
                EXPORT  TMR6_3_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_3_Dte_Handler              [WEAK]
                EXPORT  TMR6_3_SCmp_Handler             [WEAK]
                EXPORT  TMR6_4_GCmp_Handler             [WEAK]
                EXPORT  TMR6_4_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_4_Dte_Handler              [WEAK]
                EXPORT  TMR6_4_SCmp_Handler             [WEAK]
                EXPORT  TMR6_5_GCmp_Handler             [WEAK]
                EXPORT  TMR6_5_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_5_Dte_Handler              [WEAK]
                EXPORT  TMR6_5_SCmp_Handler             [WEAK]
                EXPORT  TMR6_6_GCmp_Handler             [WEAK]
                EXPORT  TMR6_6_Ovf_Udf_Handler          [WEAK]
                EXPORT  TMR6_6_Dte_Handler              [WEAK]
                EXPORT  TMR6_6_SCmp_Handler             [WEAK]
                EXPORT  TRLPWM_Handler                  [WEAK]
                EXPORT  EMB_GR0_Handler                 [WEAK]
                EXPORT  EMB_GR1_Handler                 [WEAK]
                EXPORT  EMB_GR2_Handler                 [WEAK]
                EXPORT  EMB_GR3_Handler                 [WEAK]
                EXPORT  EMB_GR4_Handler                 [WEAK]
                EXPORT  EMB_GR5_Handler                 [WEAK]
                EXPORT  HRPWM_1_Handler                 [WEAK]
                EXPORT  HRPWM_2_Handler                 [WEAK]
                EXPORT  HRPWM_3_Handler                 [WEAK]
                EXPORT  HRPWM_4_Handler                 [WEAK]
                EXPORT  HRPWM_5_Handler                 [WEAK]
                EXPORT  HRPWM_6_Handler                 [WEAK]
                EXPORT  HRPWM_7_Handler                 [WEAK]
                EXPORT  HRPWM_8_Handler                 [WEAK]
                EXPORT  HRPWM_EMB_Handler                 [WEAK]
                EXPORT  SDFM_FILTER0_Handler            [WEAK]
                EXPORT  SDFM_FILTER1_Handler            [WEAK]
                EXPORT  SDFM_FILTER2_Handler            [WEAK]
                EXPORT  SDFM_FILTER3_Handler            [WEAK]
                EXPORT  CMP1_Handler                    [WEAK]
                EXPORT  CMP2_Handler                    [WEAK]
                EXPORT  CMP3_Handler                    [WEAK]
                EXPORT  CMP4_Handler                    [WEAK]
                EXPORT  CMP5_Handler                    [WEAK]
                EXPORT  CMP6_Handler                    [WEAK]
                EXPORT  CMP7_Handler                    [WEAK]
                EXPORT  CMP8_Handler                    [WEAK]
                EXPORT  SPI1_Handler                    [WEAK]
                EXPORT  SPI2_Handler                    [WEAK]
                EXPORT  SPI3_Handler                    [WEAK]
                EXPORT  EVENT_PORT1_Handler             [WEAK]
                EXPORT  EVENT_PORT2_Handler             [WEAK]
                EXPORT  EVENT_PORT3_Handler             [WEAK]
                EXPORT  EVENT_PORT4_Handler             [WEAK]
                EXPORT  MCANRAM_ECCER_Handler           [WEAK]
                EXPORT  MCAN1_INT0_Handler              [WEAK]
                EXPORT  MCAN1_INT1_Handler              [WEAK]
                EXPORT  MCAN2_INT0_Handler              [WEAK]
                EXPORT  MCAN2_INT1_Handler              [WEAK]
                EXPORT  MCAN3_INT0_Handler              [WEAK]
                EXPORT  MCAN3_INT1_Handler              [WEAK]
                EXPORT  USART1_Handler                  [WEAK]
                EXPORT  USART1_TxComplete_Handler       [WEAK]
                EXPORT  USART2_Handler                  [WEAK]
                EXPORT  USART2_TxComplete_Handler       [WEAK]
                EXPORT  USART3_Handler                  [WEAK]
                EXPORT  USART3_TxComplete_Handler       [WEAK]
                EXPORT  USART4_Handler                  [WEAK]
                EXPORT  USART4_TxComplete_Handler       [WEAK]
                EXPORT  HASH_Handler                    [WEAK]
                EXPORT  SKE_Handler                     [WEAK]
                EXPORT  SOGI_Handler                    [WEAK]
                EXPORT  I2C1_Handler                    [WEAK]
                EXPORT  I2C2_Handler                    [WEAK]
                EXPORT  I2C3_Handler                    [WEAK]
                EXPORT  SPI_SS0_WUPI_Handler            [WEAK]
                EXPORT  USART1_WUPI_Handler             [WEAK]
                EXPORT  LVD1_Handler                    [WEAK]
                EXPORT  LVD2_Handler                    [WEAK]
                EXPORT  FCM_Handler                     [WEAK]
                EXPORT  WDT_Handler                     [WEAK]
                EXPORT  CTC_Handler                     [WEAK]
                EXPORT  ERMU_LPI_Handler                [WEAK]
                EXPORT  ADC1_Handler                    [WEAK]
                EXPORT  ADC2_Handler                    [WEAK]
                EXPORT  ADC3_Handler                    [WEAK]
                EXPORT  ADC4_Handler                    [WEAK]
                EXPORT  TRNG_Handler                    [WEAK]

