MAXLII/ATOMAN/hc32f558/Firmware/CMSIS/HDSC/hc32f5xx/Source/ARM/startup_hc32f558.s
IRQ000_Handler
IRQ001_Handler
IRQ002_Handler
IRQ003_Handler
IRQ004_Handler
IRQ005_Handler
IRQ006_Handler
IRQ007_Handler
IRQ008_Handler
IRQ009_Handler
IRQ010_Handler
IRQ011_Handler
IRQ012_Handler
IRQ013_Handler
IRQ014_Handler
IRQ015_Handler
EXTINT_PORT_EIRQ0_Handler
EXTINT_PORT_EIRQ1_Handler
EXTINT_PORT_EIRQ2_Handler
EXTINT_PORT_EIRQ3_Handler
EXTINT_PORT_EIRQ4_Handler
EXTINT_PORT_EIRQ5_Handler
EXTINT_PORT_EIRQ6_Handler
EXTINT_PORT_EIRQ7_Handler
EXTINT_PORT_EIRQ8_Handler
EXTINT_PORT_EIRQ9_Handler
EXTINT_PORT_EIRQ10_Handler
EXTINT_PORT_EIRQ11_Handler
EXTINT_PORT_EIRQ12_Handler
EXTINT_PORT_EIRQ13_Handler
EXTINT_PORT_EIRQ14_Handler
EXTINT_PORT_EIRQ15_Handler
DMA1_Error_Handler
DMA1_TC0_BTC0_Handler
DMA1_TC1_BTC1_Handler
DMA1_TC2_BTC2_Handler
DMA1_TC3_BTC3_Handler
DMA1_TC4_BTC4_Handler
DMA1_TC5_BTC5_Handler
DMA1_TC6_BTC6_Handler
DMA1_TC7_BTC7_Handler
EFM_PEError_ReadCol_Handler
EFM_OpEnd_Handler
FPU_Error_Handler
DMA2_Error_Handler
DMA2_TC0_BTC0_Handler
DMA2_TC1_BTC1_Handler
DMA2_TC2_BTC2_Handler
DMA2_TC3_BTC3_Handler
DMA2_TC4_BTC4_Handler
DMA2_TC5_BTC5_Handler
DMA2_TC6_BTC6_Handler
DMA2_TC7_BTC7_Handler
PID_CALC_OV_Handler
PID_CMP_Handler
FMAC_FIR_Handler
FMAC_IIR_Handler
FMAC_RAM_ECC_ERR_Handler
CORDIC_Handler
TMR0_1_Handler
TMR0_2_Handler
XTAL_Handler
SWDT_Handler
TMR6_1_GCmp_Handler
TMR6_1_Ovf_Udf_Handler
TMR6_1_Dte_Handler
TMR6_1_SCmp_Handler
TMR6_2_GCmp_Handler
TMR6_2_Ovf_Udf_Handler
TMR6_2_Dte_Handler
TMR6_2_SCmp_Handler
TMR6_3_GCmp_Handler
TMR6_3_Ovf_Udf_Handler
TMR6_3_Dte_Handler
TMR6_3_SCmp_Handler
TMR6_4_GCmp_Handler
TMR6_4_Ovf_Udf_Handler
TMR6_4_Dte_Handler
TMR6_4_SCmp_Handler
TMR6_5_GCmp_Handler
TMR6_5_Ovf_Udf_Handler
TMR6_5_Dte_Handler
TMR6_5_SCmp_Handler
TMR6_6_GCmp_Handler
TMR6_6_Ovf_Udf_Handler
TMR6_6_Dte_Handler
TMR6_6_SCmp_Handler
TRLPWM_Handler
EMB_GR0_Handler
EMB_GR1_Handler
EMB_GR2_Handler
EMB_GR3_Handler
EMB_GR4_Handler
EMB_GR5_Handler
HRPWM_1_Handler
HRPWM_2_Handler
HRPWM_3_Handler
HRPWM_4_Handler
HRPWM_5_Handler
HRPWM_6_Handler
HRPWM_7_Handler
HRPWM_8_Handler
HRPWM_EMB_Handler
SDFM_FILTER0_Handler
SDFM_FILTER1_Handler
SDFM_FILTER2_Handler
SDFM_FILTER3_Handler
CMP1_Handler
CMP2_Handler
CMP3_Handler
CMP4_Handler
CMP5_Handler
CMP6_Handler
CMP7_Handler
CMP8_Handler
SPI1_Handler
SPI2_Handler
SPI3_Handler
EVENT_PORT1_Handler
EVENT_PORT2_Handler
EVENT_PORT3_Handler
EVENT_PORT4_Handler
MCANRAM_ECCER_Handler
MCAN1_INT0_Handler
MCAN1_INT1_Handler
MCAN2_INT0_Handler
MCAN2_INT1_Handler
MCAN3_INT0_Handler
MCAN3_INT1_Handler
USART1_Handler
USART1_TxComplete_Handler
USART2_Handler
USART2_TxComplete_Handler
USART3_Handler
USART3_TxComplete_Handler
USART4_Handler
USART4_TxComplete_Handler
HASH_Handler
SKE_Handler
SOGI_Handler
I2C1_Handler
I2C2_Handler
I2C3_Handler
SPI_SS0_WUPI_Handler
USART1_WUPI_Handler
LVD1_Handler
LVD2_Handler
FCM_Handler
WDT_Handler
CTC_Handler
ERMU_LPI_Handler
ADC1_Handler
ADC2_Handler
ADC3_Handler
ADC4_Handler
TRNG_Handler

                B .

                ENDP

                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END
